// Generated by jextract

package org.sandium.core.libs.glfw;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkCmdProcessCommandsInfoNVX {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkObjectTableNVX objectTable;
 *     VkIndirectCommandsLayoutNVX indirectCommandsLayout;
 *     uint32_t indirectCommandsTokenCount;
 *     const VkIndirectCommandsTokenNVX *pIndirectCommandsTokens;
 *     uint32_t maxSequencesCount;
 *     VkCommandBuffer targetCommandBuffer;
 *     VkBuffer sequencesCountBuffer;
 *     VkDeviceSize sequencesCountOffset;
 *     VkBuffer sequencesIndexBuffer;
 *     VkDeviceSize sequencesIndexOffset;
 * }
 * }
 */
public class VkCmdProcessCommandsInfoNVX {

    VkCmdProcessCommandsInfoNVX() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        glfw3_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        glfw3_h.C_POINTER.withName("pNext"),
        glfw3_h.C_POINTER.withName("objectTable"),
        glfw3_h.C_POINTER.withName("indirectCommandsLayout"),
        glfw3_h.C_INT.withName("indirectCommandsTokenCount"),
        MemoryLayout.paddingLayout(4),
        glfw3_h.C_POINTER.withName("pIndirectCommandsTokens"),
        glfw3_h.C_INT.withName("maxSequencesCount"),
        MemoryLayout.paddingLayout(4),
        glfw3_h.C_POINTER.withName("targetCommandBuffer"),
        glfw3_h.C_POINTER.withName("sequencesCountBuffer"),
        glfw3_h.C_LONG.withName("sequencesCountOffset"),
        glfw3_h.C_POINTER.withName("sequencesIndexBuffer"),
        glfw3_h.C_LONG.withName("sequencesIndexOffset")
    ).withName("VkCmdProcessCommandsInfoNVX");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final AddressLayout objectTable$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("objectTable"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static final AddressLayout objectTable$layout() {
        return objectTable$LAYOUT;
    }

    private static final long objectTable$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static final long objectTable$offset() {
        return objectTable$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static MemorySegment objectTable(MemorySegment struct) {
        return struct.get(objectTable$LAYOUT, objectTable$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static void objectTable(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(objectTable$LAYOUT, objectTable$OFFSET, fieldValue);
    }

    private static final AddressLayout indirectCommandsLayout$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("indirectCommandsLayout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static final AddressLayout indirectCommandsLayout$layout() {
        return indirectCommandsLayout$LAYOUT;
    }

    private static final long indirectCommandsLayout$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static final long indirectCommandsLayout$offset() {
        return indirectCommandsLayout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static MemorySegment indirectCommandsLayout(MemorySegment struct) {
        return struct.get(indirectCommandsLayout$LAYOUT, indirectCommandsLayout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static void indirectCommandsLayout(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(indirectCommandsLayout$LAYOUT, indirectCommandsLayout$OFFSET, fieldValue);
    }

    private static final OfInt indirectCommandsTokenCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("indirectCommandsTokenCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t indirectCommandsTokenCount
     * }
     */
    public static final OfInt indirectCommandsTokenCount$layout() {
        return indirectCommandsTokenCount$LAYOUT;
    }

    private static final long indirectCommandsTokenCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t indirectCommandsTokenCount
     * }
     */
    public static final long indirectCommandsTokenCount$offset() {
        return indirectCommandsTokenCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t indirectCommandsTokenCount
     * }
     */
    public static int indirectCommandsTokenCount(MemorySegment struct) {
        return struct.get(indirectCommandsTokenCount$LAYOUT, indirectCommandsTokenCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t indirectCommandsTokenCount
     * }
     */
    public static void indirectCommandsTokenCount(MemorySegment struct, int fieldValue) {
        struct.set(indirectCommandsTokenCount$LAYOUT, indirectCommandsTokenCount$OFFSET, fieldValue);
    }

    private static final AddressLayout pIndirectCommandsTokens$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pIndirectCommandsTokens"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const VkIndirectCommandsTokenNVX *pIndirectCommandsTokens
     * }
     */
    public static final AddressLayout pIndirectCommandsTokens$layout() {
        return pIndirectCommandsTokens$LAYOUT;
    }

    private static final long pIndirectCommandsTokens$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const VkIndirectCommandsTokenNVX *pIndirectCommandsTokens
     * }
     */
    public static final long pIndirectCommandsTokens$offset() {
        return pIndirectCommandsTokens$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const VkIndirectCommandsTokenNVX *pIndirectCommandsTokens
     * }
     */
    public static MemorySegment pIndirectCommandsTokens(MemorySegment struct) {
        return struct.get(pIndirectCommandsTokens$LAYOUT, pIndirectCommandsTokens$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const VkIndirectCommandsTokenNVX *pIndirectCommandsTokens
     * }
     */
    public static void pIndirectCommandsTokens(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pIndirectCommandsTokens$LAYOUT, pIndirectCommandsTokens$OFFSET, fieldValue);
    }

    private static final OfInt maxSequencesCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxSequencesCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static final OfInt maxSequencesCount$layout() {
        return maxSequencesCount$LAYOUT;
    }

    private static final long maxSequencesCount$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static final long maxSequencesCount$offset() {
        return maxSequencesCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static int maxSequencesCount(MemorySegment struct) {
        return struct.get(maxSequencesCount$LAYOUT, maxSequencesCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static void maxSequencesCount(MemorySegment struct, int fieldValue) {
        struct.set(maxSequencesCount$LAYOUT, maxSequencesCount$OFFSET, fieldValue);
    }

    private static final AddressLayout targetCommandBuffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("targetCommandBuffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkCommandBuffer targetCommandBuffer
     * }
     */
    public static final AddressLayout targetCommandBuffer$layout() {
        return targetCommandBuffer$LAYOUT;
    }

    private static final long targetCommandBuffer$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkCommandBuffer targetCommandBuffer
     * }
     */
    public static final long targetCommandBuffer$offset() {
        return targetCommandBuffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkCommandBuffer targetCommandBuffer
     * }
     */
    public static MemorySegment targetCommandBuffer(MemorySegment struct) {
        return struct.get(targetCommandBuffer$LAYOUT, targetCommandBuffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkCommandBuffer targetCommandBuffer
     * }
     */
    public static void targetCommandBuffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(targetCommandBuffer$LAYOUT, targetCommandBuffer$OFFSET, fieldValue);
    }

    private static final AddressLayout sequencesCountBuffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sequencesCountBuffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBuffer sequencesCountBuffer
     * }
     */
    public static final AddressLayout sequencesCountBuffer$layout() {
        return sequencesCountBuffer$LAYOUT;
    }

    private static final long sequencesCountBuffer$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBuffer sequencesCountBuffer
     * }
     */
    public static final long sequencesCountBuffer$offset() {
        return sequencesCountBuffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBuffer sequencesCountBuffer
     * }
     */
    public static MemorySegment sequencesCountBuffer(MemorySegment struct) {
        return struct.get(sequencesCountBuffer$LAYOUT, sequencesCountBuffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBuffer sequencesCountBuffer
     * }
     */
    public static void sequencesCountBuffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sequencesCountBuffer$LAYOUT, sequencesCountBuffer$OFFSET, fieldValue);
    }

    private static final OfLong sequencesCountOffset$LAYOUT = (OfLong)$LAYOUT.select(groupElement("sequencesCountOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesCountOffset
     * }
     */
    public static final OfLong sequencesCountOffset$layout() {
        return sequencesCountOffset$LAYOUT;
    }

    private static final long sequencesCountOffset$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesCountOffset
     * }
     */
    public static final long sequencesCountOffset$offset() {
        return sequencesCountOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesCountOffset
     * }
     */
    public static long sequencesCountOffset(MemorySegment struct) {
        return struct.get(sequencesCountOffset$LAYOUT, sequencesCountOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesCountOffset
     * }
     */
    public static void sequencesCountOffset(MemorySegment struct, long fieldValue) {
        struct.set(sequencesCountOffset$LAYOUT, sequencesCountOffset$OFFSET, fieldValue);
    }

    private static final AddressLayout sequencesIndexBuffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("sequencesIndexBuffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkBuffer sequencesIndexBuffer
     * }
     */
    public static final AddressLayout sequencesIndexBuffer$layout() {
        return sequencesIndexBuffer$LAYOUT;
    }

    private static final long sequencesIndexBuffer$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkBuffer sequencesIndexBuffer
     * }
     */
    public static final long sequencesIndexBuffer$offset() {
        return sequencesIndexBuffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkBuffer sequencesIndexBuffer
     * }
     */
    public static MemorySegment sequencesIndexBuffer(MemorySegment struct) {
        return struct.get(sequencesIndexBuffer$LAYOUT, sequencesIndexBuffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkBuffer sequencesIndexBuffer
     * }
     */
    public static void sequencesIndexBuffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(sequencesIndexBuffer$LAYOUT, sequencesIndexBuffer$OFFSET, fieldValue);
    }

    private static final OfLong sequencesIndexOffset$LAYOUT = (OfLong)$LAYOUT.select(groupElement("sequencesIndexOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesIndexOffset
     * }
     */
    public static final OfLong sequencesIndexOffset$layout() {
        return sequencesIndexOffset$LAYOUT;
    }

    private static final long sequencesIndexOffset$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesIndexOffset
     * }
     */
    public static final long sequencesIndexOffset$offset() {
        return sequencesIndexOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesIndexOffset
     * }
     */
    public static long sequencesIndexOffset(MemorySegment struct) {
        return struct.get(sequencesIndexOffset$LAYOUT, sequencesIndexOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkDeviceSize sequencesIndexOffset
     * }
     */
    public static void sequencesIndexOffset(MemorySegment struct, long fieldValue) {
        struct.set(sequencesIndexOffset$LAYOUT, sequencesIndexOffset$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

