// Generated by jextract

package org.sandium.core.libs.glfw;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkDeviceGeneratedCommandsLimitsNVX {
 *     VkStructureType sType;
 *     const void *pNext;
 *     uint32_t maxIndirectCommandsLayoutTokenCount;
 *     uint32_t maxObjectEntryCounts;
 *     uint32_t minSequenceCountBufferOffsetAlignment;
 *     uint32_t minSequenceIndexBufferOffsetAlignment;
 *     uint32_t minCommandsTokenBufferOffsetAlignment;
 * }
 * }
 */
public class VkDeviceGeneratedCommandsLimitsNVX {

    VkDeviceGeneratedCommandsLimitsNVX() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        glfw3_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        glfw3_h.C_POINTER.withName("pNext"),
        glfw3_h.C_INT.withName("maxIndirectCommandsLayoutTokenCount"),
        glfw3_h.C_INT.withName("maxObjectEntryCounts"),
        glfw3_h.C_INT.withName("minSequenceCountBufferOffsetAlignment"),
        glfw3_h.C_INT.withName("minSequenceIndexBufferOffsetAlignment"),
        glfw3_h.C_INT.withName("minCommandsTokenBufferOffsetAlignment"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkDeviceGeneratedCommandsLimitsNVX");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final OfInt maxIndirectCommandsLayoutTokenCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxIndirectCommandsLayoutTokenCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxIndirectCommandsLayoutTokenCount
     * }
     */
    public static final OfInt maxIndirectCommandsLayoutTokenCount$layout() {
        return maxIndirectCommandsLayoutTokenCount$LAYOUT;
    }

    private static final long maxIndirectCommandsLayoutTokenCount$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxIndirectCommandsLayoutTokenCount
     * }
     */
    public static final long maxIndirectCommandsLayoutTokenCount$offset() {
        return maxIndirectCommandsLayoutTokenCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxIndirectCommandsLayoutTokenCount
     * }
     */
    public static int maxIndirectCommandsLayoutTokenCount(MemorySegment struct) {
        return struct.get(maxIndirectCommandsLayoutTokenCount$LAYOUT, maxIndirectCommandsLayoutTokenCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxIndirectCommandsLayoutTokenCount
     * }
     */
    public static void maxIndirectCommandsLayoutTokenCount(MemorySegment struct, int fieldValue) {
        struct.set(maxIndirectCommandsLayoutTokenCount$LAYOUT, maxIndirectCommandsLayoutTokenCount$OFFSET, fieldValue);
    }

    private static final OfInt maxObjectEntryCounts$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxObjectEntryCounts"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxObjectEntryCounts
     * }
     */
    public static final OfInt maxObjectEntryCounts$layout() {
        return maxObjectEntryCounts$LAYOUT;
    }

    private static final long maxObjectEntryCounts$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxObjectEntryCounts
     * }
     */
    public static final long maxObjectEntryCounts$offset() {
        return maxObjectEntryCounts$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxObjectEntryCounts
     * }
     */
    public static int maxObjectEntryCounts(MemorySegment struct) {
        return struct.get(maxObjectEntryCounts$LAYOUT, maxObjectEntryCounts$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxObjectEntryCounts
     * }
     */
    public static void maxObjectEntryCounts(MemorySegment struct, int fieldValue) {
        struct.set(maxObjectEntryCounts$LAYOUT, maxObjectEntryCounts$OFFSET, fieldValue);
    }

    private static final OfInt minSequenceCountBufferOffsetAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("minSequenceCountBufferOffsetAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t minSequenceCountBufferOffsetAlignment
     * }
     */
    public static final OfInt minSequenceCountBufferOffsetAlignment$layout() {
        return minSequenceCountBufferOffsetAlignment$LAYOUT;
    }

    private static final long minSequenceCountBufferOffsetAlignment$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t minSequenceCountBufferOffsetAlignment
     * }
     */
    public static final long minSequenceCountBufferOffsetAlignment$offset() {
        return minSequenceCountBufferOffsetAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t minSequenceCountBufferOffsetAlignment
     * }
     */
    public static int minSequenceCountBufferOffsetAlignment(MemorySegment struct) {
        return struct.get(minSequenceCountBufferOffsetAlignment$LAYOUT, minSequenceCountBufferOffsetAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t minSequenceCountBufferOffsetAlignment
     * }
     */
    public static void minSequenceCountBufferOffsetAlignment(MemorySegment struct, int fieldValue) {
        struct.set(minSequenceCountBufferOffsetAlignment$LAYOUT, minSequenceCountBufferOffsetAlignment$OFFSET, fieldValue);
    }

    private static final OfInt minSequenceIndexBufferOffsetAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("minSequenceIndexBufferOffsetAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t minSequenceIndexBufferOffsetAlignment
     * }
     */
    public static final OfInt minSequenceIndexBufferOffsetAlignment$layout() {
        return minSequenceIndexBufferOffsetAlignment$LAYOUT;
    }

    private static final long minSequenceIndexBufferOffsetAlignment$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t minSequenceIndexBufferOffsetAlignment
     * }
     */
    public static final long minSequenceIndexBufferOffsetAlignment$offset() {
        return minSequenceIndexBufferOffsetAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t minSequenceIndexBufferOffsetAlignment
     * }
     */
    public static int minSequenceIndexBufferOffsetAlignment(MemorySegment struct) {
        return struct.get(minSequenceIndexBufferOffsetAlignment$LAYOUT, minSequenceIndexBufferOffsetAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t minSequenceIndexBufferOffsetAlignment
     * }
     */
    public static void minSequenceIndexBufferOffsetAlignment(MemorySegment struct, int fieldValue) {
        struct.set(minSequenceIndexBufferOffsetAlignment$LAYOUT, minSequenceIndexBufferOffsetAlignment$OFFSET, fieldValue);
    }

    private static final OfInt minCommandsTokenBufferOffsetAlignment$LAYOUT = (OfInt)$LAYOUT.select(groupElement("minCommandsTokenBufferOffsetAlignment"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t minCommandsTokenBufferOffsetAlignment
     * }
     */
    public static final OfInt minCommandsTokenBufferOffsetAlignment$layout() {
        return minCommandsTokenBufferOffsetAlignment$LAYOUT;
    }

    private static final long minCommandsTokenBufferOffsetAlignment$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t minCommandsTokenBufferOffsetAlignment
     * }
     */
    public static final long minCommandsTokenBufferOffsetAlignment$offset() {
        return minCommandsTokenBufferOffsetAlignment$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t minCommandsTokenBufferOffsetAlignment
     * }
     */
    public static int minCommandsTokenBufferOffsetAlignment(MemorySegment struct) {
        return struct.get(minCommandsTokenBufferOffsetAlignment$LAYOUT, minCommandsTokenBufferOffsetAlignment$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t minCommandsTokenBufferOffsetAlignment
     * }
     */
    public static void minCommandsTokenBufferOffsetAlignment(MemorySegment struct, int fieldValue) {
        struct.set(minCommandsTokenBufferOffsetAlignment$LAYOUT, minCommandsTokenBufferOffsetAlignment$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

