// Generated by jextract

package sandium.libs.glfw;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VkCmdReserveSpaceForCommandsInfoNVX {
 *     VkStructureType sType;
 *     const void *pNext;
 *     VkObjectTableNVX objectTable;
 *     VkIndirectCommandsLayoutNVX indirectCommandsLayout;
 *     uint32_t maxSequencesCount;
 * }
 * }
 */
public class VkCmdReserveSpaceForCommandsInfoNVX {

    VkCmdReserveSpaceForCommandsInfoNVX() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        glfw3_h.C_INT.withName("sType"),
        MemoryLayout.paddingLayout(4),
        glfw3_h.C_POINTER.withName("pNext"),
        glfw3_h.C_POINTER.withName("objectTable"),
        glfw3_h.C_POINTER.withName("indirectCommandsLayout"),
        glfw3_h.C_INT.withName("maxSequencesCount"),
        MemoryLayout.paddingLayout(4)
    ).withName("VkCmdReserveSpaceForCommandsInfoNVX");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt sType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final OfInt sType$layout() {
        return sType$LAYOUT;
    }

    private static final long sType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static final long sType$offset() {
        return sType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static int sType(MemorySegment struct) {
        return struct.get(sType$LAYOUT, sType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkStructureType sType
     * }
     */
    public static void sType(MemorySegment struct, int fieldValue) {
        struct.set(sType$LAYOUT, sType$OFFSET, fieldValue);
    }

    private static final AddressLayout pNext$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pNext"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final AddressLayout pNext$layout() {
        return pNext$LAYOUT;
    }

    private static final long pNext$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static final long pNext$offset() {
        return pNext$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static MemorySegment pNext(MemorySegment struct) {
        return struct.get(pNext$LAYOUT, pNext$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const void *pNext
     * }
     */
    public static void pNext(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pNext$LAYOUT, pNext$OFFSET, fieldValue);
    }

    private static final AddressLayout objectTable$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("objectTable"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static final AddressLayout objectTable$layout() {
        return objectTable$LAYOUT;
    }

    private static final long objectTable$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static final long objectTable$offset() {
        return objectTable$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static MemorySegment objectTable(MemorySegment struct) {
        return struct.get(objectTable$LAYOUT, objectTable$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkObjectTableNVX objectTable
     * }
     */
    public static void objectTable(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(objectTable$LAYOUT, objectTable$OFFSET, fieldValue);
    }

    private static final AddressLayout indirectCommandsLayout$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("indirectCommandsLayout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static final AddressLayout indirectCommandsLayout$layout() {
        return indirectCommandsLayout$LAYOUT;
    }

    private static final long indirectCommandsLayout$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static final long indirectCommandsLayout$offset() {
        return indirectCommandsLayout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static MemorySegment indirectCommandsLayout(MemorySegment struct) {
        return struct.get(indirectCommandsLayout$LAYOUT, indirectCommandsLayout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VkIndirectCommandsLayoutNVX indirectCommandsLayout
     * }
     */
    public static void indirectCommandsLayout(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(indirectCommandsLayout$LAYOUT, indirectCommandsLayout$OFFSET, fieldValue);
    }

    private static final OfInt maxSequencesCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("maxSequencesCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static final OfInt maxSequencesCount$layout() {
        return maxSequencesCount$LAYOUT;
    }

    private static final long maxSequencesCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static final long maxSequencesCount$offset() {
        return maxSequencesCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static int maxSequencesCount(MemorySegment struct) {
        return struct.get(maxSequencesCount$LAYOUT, maxSequencesCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t maxSequencesCount
     * }
     */
    public static void maxSequencesCount(MemorySegment struct, int fieldValue) {
        struct.set(maxSequencesCount$LAYOUT, maxSequencesCount$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

